{
  "backend/main.mo": "Motoko actor managing portfolio data with authorization, CRUD operations, and seed initialization for skills and projects.",
  "feature_evidence.json": "Feature evidence report describing a required update to the HomePage typing words list.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including pages, hooks, components, and layouts.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration setting up public and admin routes with theme provider and seed initialization.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown to users without admin access including message and return-home button.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling authentication state and query cache clearing.",
  "frontend/src/components/controls/DarkModeToggle.tsx": "Theme toggle button switching between light and dark modes using next-themes.",
  "frontend/src/components/home/TypingWord.tsx": "Animated typing component cycling through provided words, supporting reduced-motion preferences.",
  "frontend/src/components/layout/AdminLayout.tsx": "Defines the admin layout with authentication checks, navigation links, and page structure for admin routes.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/layout/PublicLayout.tsx": "Provides the public site layout with navbar, main content area, and footer.",
  "frontend/src/components/layout/PublicNavbar.tsx": "Implements the public navigation bar with desktop and mobile menus and dark mode toggle.",
  "frontend/src/components/projects/ProjectCard.tsx": "Displays a project card with image, description, technologies, and optional links to demo or GitHub.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, reinitializing on identity changes and invalidating related queries.",
  "frontend/src/hooks/useAdminGuard.ts": "Determines admin access state by checking authentication and admin privileges.",
  "frontend/src/hooks/useAdminMutations.ts": "Provides mutation hooks for creating, updating, and deleting admin-managed data like projects and skills.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides admin-related queries for messages, admin status, and user profile.",
  "frontend/src/hooks/useContactSubmission.ts": "Handles submitting contact form messages through the backend actor.",
  "frontend/src/hooks/useInitializeSeed.ts": "Initializes seed data if the caller is an admin and the actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and stored identity handling.",
  "frontend/src/hooks/usePortfolioQueries.ts": "Defines React Query hooks to fetch portfolio data (about, skills, projects, experiences, and social links) from the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, dark mode settings, base styles, and small utility/component classes.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Loads and displays the About content with a profile image and fallback skeletons.",
  "frontend/src/pages/admin/AdminAboutPage.tsx": "Fetches and edits the About page content through a form using admin update mutations.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders admin navigation cards linking to various management sections like projects, skills, and messages.",
  "frontend/src/pages/admin/AdminExperiencePage.tsx": "Manages CRUD operations for experience entries with dialogs for adding, editing, and deleting.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Displays contact messages with options to mark as read or delete, sorting them by creation date.",
  "frontend/src/pages/admin/AdminProjectsPage.tsx": "Provides project management with creation, editing, and deletion using a dialog-driven form interface.",
  "frontend/src/pages/admin/AdminSkillsPage.tsx": "Manages skills with CRUD operations, offering a dialog form for adding or editing skill details.",
  "frontend/src/pages/admin/AdminSocialLinksPage.tsx": "Admin page providing CRUD UI for social links using dialog forms and mutations.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation, submission handling, and displays social links with icons.",
  "frontend/src/pages/ExperiencePage.tsx": "Fetches and displays work experience entries with a timeline layout and skeleton placeholders.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage hero section with typing animation and quick navigation links.",
  "frontend/src/pages/ProjectsPage.tsx": "Fetches and lists portfolio projects using ProjectCard components with loading skeletons.",
  "frontend/src/pages/SkillsPage.tsx": "Displays grouped skills by category, showing skeletons while loading and skill cards once data loads.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins.",
  "project_state.json": "Project state metadata describing architecture, feature requirements, and known issues."
}