{
  "backend/main.mo": "Motoko canister implementing admin email/password auth, session handling, and CRUD storage for portfolio data with mixin-based authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report linking specific frontend files to logout-loading and session-hook enhancements with associated components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across components, hooks, pages, and layouts.",
  "frontend/index.css": "Tailwind CSS setup with custom CSS variables for light/dark themes and base styling.",
  "frontend/index.html": "HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Root React router configuration defining all public and admin routes and wrapping the app with theme and toast providers.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user without admin access attempts to view admin content.",
  "frontend/src/components/auth/AdminEmailLoginForm.tsx": "Email/password admin login form handling credential submission, error states, and redirecting after successful login.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading indicators and query cache clearing on logout.",
  "frontend/src/components/controls/DarkModeToggle.tsx": "Button allowing users to toggle between light and dark themes using next-themes.",
  "frontend/src/components/home/TypingWord.tsx": "Animates typing and deleting a list of words, with reduced‑motion support and stable layout width.",
  "frontend/src/components/layout/AdminLayout.tsx": "Provides the admin dashboard shell with auth guard, navigation, and logout handling.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/layout/PublicLayout.tsx": "Wraps public pages with a navbar, main content area, and footer.",
  "frontend/src/components/layout/PublicNavbar.tsx": "Displays the public navigation bar with responsive mobile menu and dark‑mode toggle.",
  "frontend/src/components/projects/ProjectCard.tsx": "Shows a project card with image, description, technologies, and links to demo or GitHub.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Returns admin authentication status for protecting admin routes.",
  "frontend/src/hooks/useAdminMutations.ts": "Provides React Query mutations for creating, updating, and deleting admin‑managed entities with toast feedback.",
  "frontend/src/hooks/useAdminQueries.ts": "Fetches admin data such as contact messages and the caller's user profile using the actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session state using shared token storage, validates sessions, and provides login/logout mutations with react-query.",
  "frontend/src/hooks/useContactSubmission.ts": "Handles submitting contact messages through the actor API and invalidates related queries with success/error toasts.",
  "frontend/src/hooks/useInitializeSeed.ts": "Initializes seed data when caller is admin and triggers cache invalidation after running once.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePortfolioQueries.ts": "Exposes react-query hooks to fetch portfolio data including about, skills, projects, experiences, and social links.",
  "frontend/src/index.css": "Defines Tailwind base, theme variables, dark mode values, and utility/component styles including animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About section, fetching about content and showing loading skeletons and profile info.",
  "frontend/src/pages/admin/AdminAboutPage.tsx": "Admin interface to view and edit About page content using a form and update mutation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin overview page listing management sections with icons and navigation links.",
  "frontend/src/pages/admin/AdminExperiencePage.tsx": "Admin CRUD interface for managing experience entries with dialogs for creating, editing, and deleting.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Admin view for reading, marking, and deleting contact form messages sorted by date.",
  "frontend/src/pages/admin/AdminProjectsPage.tsx": "Admin UI page for listing, creating, editing, and deleting portfolio projects using dialogs and form state.",
  "frontend/src/pages/admin/AdminSkillsPage.tsx": "Admin page for managing skills with CRUD operations, form dialogs, and category/level selection.",
  "frontend/src/pages/admin/AdminSocialLinksPage.tsx": "Admin CRUD interface for managing social media links with dialogs and table display.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation, submits messages, and lists social links with icons.",
  "frontend/src/pages/ExperiencePage.tsx": "Shows a timeline of work experiences with loading skeletons and detailed experience cards.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, animated typing titles, and quick navigation links to major site sections.",
  "frontend/src/pages/ProjectsPage.tsx": "Fetches and displays portfolio projects with loading skeletons and fallback messaging.",
  "frontend/src/pages/SkillsPage.tsx": "Loads skills, groups them by category, and displays them in structured cards with loading placeholders.",
  "frontend/src/utils/adminRedirect.ts": "Utility for storing, retrieving, and clearing intended admin redirect paths in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "File storing project metadata, feature requirements, architectural notes, and known issues."
}