{
  "backend/main.mo": "Main Motoko actor implementing portfolio data storage, admin email/password authentication, session handling, and CRUD logic using mixins and maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and base styling.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Defines TanStack Router routes for public and admin pages, wraps the app in theming, and initializes seed data.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen informing users they lack permission to access admin pages with a button to return home.",
  "frontend/src/components/auth/AdminEmailLoginForm.tsx": "Admin email/password login form that handles authentication, errors, and redirecting to the intended admin path.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and query cache clearing on logout.",
  "frontend/src/components/controls/DarkModeToggle.tsx": "Button to toggle light/dark theme using next-themes with animated sun/moon icons.",
  "frontend/src/components/home/TypingWord.tsx": "Animated typing/deleting word component with reduced‑motion handling and dynamic width reservation.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin layout that guards access, renders navigation and header, and handles login redirects and logout.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, branding, and a referral link to caffeine.ai.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public site layout wrapping pages with navbar and footer.",
  "frontend/src/components/layout/PublicNavbar.tsx": "Responsive public navigation bar with desktop and mobile menus and dark mode toggle.",
  "frontend/src/components/projects/ProjectCard.tsx": "Card displaying project details, technologies, image, and links to demo and GitHub.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries.",
  "frontend/src/hooks/useAdminGuard.ts": "Simple guard hook returning admin auth state from the session.",
  "frontend/src/hooks/useAdminMutations.ts": "Collection of React Query mutations for creating, updating, and deleting admin‑managed entities with toast feedback.",
  "frontend/src/hooks/useAdminQueries.ts": "Queries for admin contact messages and caller user profile using the backend actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, login/logout mutations, and session validation with shared state and React Query.",
  "frontend/src/hooks/useContactSubmission.ts": "Provides a mutation for submitting contact messages and invalidating related queries with success/error toasts.",
  "frontend/src/hooks/useInitializeSeed.ts": "Initializes seed data once for admin callers and refreshes queries after setup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook using Dfinity AuthClient with login, logout, and identity state.",
  "frontend/src/hooks/usePortfolioQueries.ts": "Exports React Query hooks to fetch about info, skills, projects, experiences, and social links from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for themes, global styles, and utility/component classes including animations.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider before rendering the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About section using fetched data with loading skeletons and profile details.",
  "frontend/src/pages/admin/AdminAboutPage.tsx": "Admin interface for viewing and editing the About page content with form submission.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin landing page listing navigation cards to all management sections like projects, skills, and messages.",
  "frontend/src/pages/admin/AdminExperiencePage.tsx": "Admin panel to create, edit, and delete experience entries using dialogs and forms.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Admin page to view, mark as read, and delete contact form messages sorted by date.",
  "frontend/src/pages/admin/AdminProjectsPage.tsx": "Admin UI for listing, creating, editing, and deleting projects with a dialog-based form and mutation hooks.",
  "frontend/src/pages/admin/AdminSkillsPage.tsx": "Admin page to manage skills, providing CRUD operations via dialogs and tables using portfolio query/mutation hooks.",
  "frontend/src/pages/admin/AdminSocialLinksPage.tsx": "CRUD interface for social links, allowing admins to add, edit, and delete platform URLs using dialog forms.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation, social links, and message submission handling.",
  "frontend/src/pages/ExperiencePage.tsx": "Shows a timeline of experience entries with loading placeholders and fallback messaging.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content with typing animation, links to projects and contact, and quick navigation cards.",
  "frontend/src/pages/ProjectsPage.tsx": "Fetches and displays project cards with loading skeletons and fallback when no projects exist.",
  "frontend/src/pages/SkillsPage.tsx": "Loads skills, groups them by category, and displays them in cards with proficiency badges.",
  "frontend/src/utils/adminRedirect.ts": "Utility for storing, retrieving, and clearing intended admin redirect paths in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and modifying hash-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, fonts, and plugins for the frontend theme.",
  "project_state.json": "Project-wide metadata describing architecture, features, issues, and versioned state information."
}