{
  "backend/main.mo": "Main canister actor defining portfolio types, admin authentication, stable state, and CRUD logic with storage and authorization mixins.",
  "backend/migration.mo": "Migration module that maps old actor state to new actor state while dropping deprecated authorization fields.",
  "feature_evidence.json": "Feature evidence report linking a specific admin-login error-handling feature to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference during build or analysis.",
  "frontend/index.css": "Tailwind CSS configuration with custom theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML document setting metadata, social preview tags, and loading the React entry script.",
  "frontend/public/robots.txt": "Robots config allowing all crawlers except for admin routes and pointing to the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing all public site URLs with change frequency and priority.",
  "frontend/src/App.tsx": "Root React app configuring all public and admin routes with layout components and initialization hooks.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks admin access, with message and link back to home.",
  "frontend/src/components/auth/AdminEmailLoginForm.tsx": "Email/password admin login form handling authentication, errors, and redirecting to intended admin paths.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that triggers Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/controls/DarkModeToggle.tsx": "Theme toggle button switching between light and dark modes using next-themes.",
  "frontend/src/components/home/TypingWord.tsx": "Typing animation component cycling through words with reduced‑motion support.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin panel layout handling auth gating, intended path logic, navigation, and logout.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, branding, and a referral link to caffeine.ai.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public site layout including navbar, footer, and routed page content.",
  "frontend/src/components/layout/PublicNavbar.tsx": "Responsive public navigation bar with links, dark mode toggle, and mobile menu.",
  "frontend/src/components/projects/ProjectCard.tsx": "Project card showing image, description, tech badges, and links to live demo or GitHub.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor based on identity and invalidating dependent queries.",
  "frontend/src/hooks/useAdminGuard.ts": "Simple admin guard exposing authentication and loading state.",
  "frontend/src/hooks/useAdminMutations.ts": "Provides React Query mutations for creating, updating, and deleting admin-managed data with session-aware error handling.",
  "frontend/src/hooks/useAdminQueries.ts": "Defines queries for fetching admin contact messages and the caller’s user profile using the current actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, validation, login, and logout with shared state and React Query integration.",
  "frontend/src/hooks/useContactSubmission.ts": "Handles contact form submission via a mutation and updates related queries on success.",
  "frontend/src/hooks/useInitializeSeed.ts": "Runs initial seed logic for admin users and invalidates queries after seeding completes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for login, identity loading, and state management.",
  "frontend/src/hooks/usePortfolioQueries.ts": "Provides portfolio-related queries for fetching about info, skills, projects, experiences, social links, and files.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark themes with component utilities.",
  "frontend/src/main.tsx": "Bootstrap file that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page using portfolio data and avatar files with loading skeletons and layout styling.",
  "frontend/src/pages/admin/AdminAboutPage.tsx": "Admin page to edit and save About page content using fetch and update mutations.",
  "frontend/src/pages/admin/AdminAvatarPage.tsx": "Admin interface for viewing and uploading an avatar with file validation, preview, and upload progress.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders an admin dashboard grid linking to various management sections with icons and descriptions.",
  "frontend/src/pages/admin/AdminExperiencePage.tsx": "Provides CRUD UI for managing work experience entries using dialogs and form inputs.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Displays, sorts, marks as read, and deletes contact messages with confirmation dialogs.",
  "frontend/src/pages/admin/AdminProjectsPage.tsx": "Offers interfaces to create, edit, and delete projects with technology lists and image URLs.",
  "frontend/src/pages/admin/AdminResumePage.tsx": "Manages resume upload, validation, progress tracking, and downloading of the current resume.",
  "frontend/src/pages/admin/AdminSkillsPage.tsx": "Allows creating, editing, and deleting skills with category and level selection.",
  "frontend/src/pages/admin/AdminSocialLinksPage.tsx": "Admin UI for listing, creating, editing, and deleting social links with dialogs and form state management.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and social links, submitting messages through a mutation.",
  "frontend/src/pages/ExperiencePage.tsx": "Displays a timeline of experiences fetched from the API with loading skeletons.",
  "frontend/src/pages/HomePage.tsx": "Provides a hero section with dynamic typing text, project/contact links, and resume download handling.",
  "frontend/src/pages/ProjectsPage.tsx": "Shows a grid of project cards loaded from the API with skeleton placeholders during loading.",
  "frontend/src/pages/SkillsPage.tsx": "Fetches skills, groups them by category, and displays them in cards with loading states.",
  "frontend/src/seo/routeSeo.ts": "Defines SEO metadata mappings for public routes and provides a lookup helper.",
  "frontend/src/seo/SeoHeadManager.tsx": "Manages dynamic SEO tags, canonical links, and JSON‑LD based on route, with special handling for admin pages.",
  "frontend/src/seo/structuredData.ts": "Generates JSON‑LD structured data for website and person schemas and combines them.",
  "frontend/src/utils/adminAuthErrors.ts": "Normalizes backend admin authentication errors into simple user‑friendly messages.",
  "frontend/src/utils/adminRedirect.ts": "Stores, retrieves, and clears intended admin redirect paths via sessionStorage.",
  "frontend/src/utils/motokoOption.ts": "Utility to unwrap Motoko/Candid optional values into plain null or value.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, typography, and container settings.",
  "project_state.json": "Tracks project version, architecture notes, known issues, and existing features for a Laravel + MySQL portfolio site with an admin panel. Includes requirements for authentication, SEO, media handling, and various inconsistencies to resolve."
}