{
  "kind": "build_request",
  "title": "Simplify admin auth to single-admin session (remove role/permission assignment errors)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Update backend admin authentication/authorization to assume a single admin user and authorize admin-only operations purely by the existing email/password admin session (no role assignment, no multi-user roles).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "why not login admin yek hi user hoga"
        ]
      },
      "acceptanceCriteria": [
        "Calling `createAdminSession` with the correct credentials (`admin@gmail.com` / `Admin@92505`) succeeds and returns `#ok` without any authorization/role-assignment error.",
        "The backend does not attempt to assign roles/permissions to principals during login (no role/permission assignment step is required for a single-admin setup).",
        "All admin-only methods currently protected by `AccessControl.hasPermission(... #admin)` are instead protected by a single-admin-session check (active session for the caller, not expired).",
        "When an unauthenticated or expired-session caller invokes an admin-only method, the backend traps with an Unauthorized error message (consistent, human-readable, and includes the word \"Unauthorized\")."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure the admin login UI shows a clear login error when backend login fails due to authorization/role/permission issues, and does not display misleading \"assign user roles\" messaging to the admin user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "why not login admin yek hi user hoga"
        ]
      },
      "acceptanceCriteria": [
        "If `createAdminSession` throws/traps for any reason, the Admin Login form displays a user-friendly error in the existing error alert area.",
        "Successful login continues to redirect to the intended admin destination as currently implemented.",
        "The login screen does not show backend errors referring to assigning roles/permissions (e.g., \"Only admins can assign user roles\") in normal operation with correct credentials."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; all Motoko logic stays in `backend/main.mo`.",
    "Do not edit any files under `frontend/src/components/ui` or the immutable hook/provider entry paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding support for multiple admins, roles, or user management UI.",
    "Adding third-party authentication providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use a single-admin (one user) model for admin authentication/authorization."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}