{
  "kind": "build_request",
  "title": "Fix admin login redirect to dashboard after successful email/password login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Ensure that after a successful admin email/password login, the UI redirects the user away from the login form to the intended admin destination (defaulting to the admin dashboard at `/admin`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "After logging in as an admin, the system is not redirecting me to the admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "When a user logs in successfully from the admin login form, the app navigates to `/admin` and displays the Admin Dashboard page content (not the login form).",
        "If the user attempted to visit a specific admin sub-route (e.g. `/admin/projects`) while unauthenticated, after login the app navigates to that originally requested route instead of always going to `/admin`.",
        "Invalid credentials continue to show an inline error and do not navigate."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Fix admin session state propagation so that a successful login updates the authenticated state consistently across the admin layout/guard and login form (even when `useAdminSession()` is used in multiple components).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "After logging in as an admin, the system is not redirecting me to the admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "After login succeeds, `useAdminGuard()` reflects `isAuthenticated === true` without requiring a full page reload.",
        "The admin login state remains consistent across components that call `useAdminSession()` (e.g., the login form and `AdminLayout`).",
        "Logging out clears the session and returns the admin area to the login form on the next render."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (shadcn UI components are read-only).",
    "Do not modify any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT (compose around them instead).",
    "Keep all backend logic in the single Motoko actor (`backend/main.mo`); only introduce migrations if a state upgrade is required (not expected for this fix)."
  ],
  "nonGoals": [
    "Changing admin credentials or authentication model.",
    "Adding new backend endpoints for redirect behavior.",
    "Redesigning the admin dashboard UI beyond what is necessary to fix the redirect/session propagation bug."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}