{
  "kind": "build_request",
  "title": "Show loading indicator during admin logout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Add a visible loading state when an authenticated admin clicks the Logout button so the user can clearly see that logout is in progress until the operation completes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Please add a loader on logout so the user knows the action is processing"
        ]
      },
      "acceptanceCriteria": [
        "When the admin clicks the Logout button in the admin header (AdminLayout), the button immediately switches to a loading presentation (e.g., spinner icon + text \"Logging out...\") and becomes disabled until the logout request finishes.",
        "While logout is pending, repeated clicks do not trigger multiple logout requests.",
        "After logout completes, the admin session token is cleared as it is today and the user is shown the unauthenticated admin experience (login form / guard behavior) without leaving the UI in a loading state.",
        "All user-facing text for the loading state is in English."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Expose a dedicated logout pending/loading flag from the admin session hook so UI components can reliably render a loader during logout without conflating it with login or session validation loading.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Please add a loader on logout so the user knows the action is processing"
        ]
      },
      "acceptanceCriteria": [
        "The admin session hook returns a boolean that is true while the logout mutation is pending.",
        "AdminLayout uses this flag to render the Logout loader state (spinner + \"Logging out...\") and disable the Logout button while pending.",
        "Existing login/session validation loading behaviors continue to work and are not broken by adding the logout pending flag."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit any frontend paths marked immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing backend logout behavior or session invalidation logic.",
    "Adding new authentication methods or altering the admin login flow beyond displaying a logout loader.",
    "Adding global page loaders unrelated to logout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}