{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin logout loading indicator and dedicated pending flag",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Show a visible, disabled loading state on the AdminLayout Logout button while admin logout is in progress.",
      "acceptanceCriteria": [
        "When the admin clicks the Logout button in the admin header (AdminLayout), the button immediately switches to a loading presentation (e.g., spinner icon + text \"Logging out...\") and becomes disabled until the logout request finishes.",
        "While logout is pending, repeated clicks do not trigger multiple logout requests.",
        "After logout completes, the admin session token is cleared as it is today and the user is shown the unauthenticated admin experience (login form / guard behavior) without leaving the UI in a loading state.",
        "All user-facing text for the loading state is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AdminLayout.tsx",
          "operation": "modify",
          "description": "Update the Logout button in AdminLayout to render a pending UI state (spinner icon + English text \"Logging out...\") and disable interaction while logout is pending; ensure the click handler is guarded so multiple logout requests cannot be triggered. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Expose a dedicated isLogoutPending flag from the admin session hook and consume it in AdminLayout for logout-only loading UI.",
      "acceptanceCriteria": [
        "The admin session hook returns a boolean that is true while the logout mutation is pending.",
        "AdminLayout uses this flag to render the Logout loader state (spinner + \"Logging out...\") and disable the Logout button while pending.",
        "Existing login/session validation loading behaviors continue to work and are not broken by adding the logout pending flag."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminSession.ts",
          "operation": "modify",
          "description": "Extend useAdminSession to expose a dedicated boolean (e.g., isLogoutPending) derived from the logout mutation pending state, without conflating it with existing isLoading for login/session validation; keep existing behaviors intact."
        },
        {
          "path": "frontend/src/components/layout/AdminLayout.tsx",
          "operation": "modify",
          "description": "Consume the new useAdminSession logout-pending flag to drive the Logout button's loading presentation and disabled state, ensuring logout UI state is independent from login/session validation loading. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}